Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: See also fread(), fopen(), popen(), fgetc(), fsockopen(), and socket_set_timeout().
pt_br: Veja também fread(), fopen(), popen(), fgetc(), fsockopen() e socket_set_timeout().

source: Identical to fgets(), except that fgetss attempts to strip any HTML and PHP tags from the text it reads.
pt_br: Idêntico a fgets(), exceto que fgetss tenta retirar qualquer tag HTML ou PHP do texto que ele lê.

source: You can use the optional third parameter to specify tags which should not be stripped.
pt_br: Você pode utilizar o terceiro parâmetro opcional para especificar quais tags não devem ser retiradas.

source: See also fgets(), fopen(), fsockopen(), popen(), and strip_tags().
pt_br: Veja também fgets(), fopen(), fsockopen(), popen() e strip_tags().

source: Returns the time the file was last accessed, or FALSE in case of an error.
pt_br: Retorna a data e hora em que o arquivo foi acessado pela última vez, ou FALSE em caso de erro.

source: The time is returned as a Unix timestamp.
pt_br: O tempo que é retornado é um timestamp UNIX.

source: The atime of a file is supposed to change whenever the data blocks of a file are being read.
pt_br: O atime do arquivo supostamente deve mudar quando os blocos de informação do arquivo forem lidos.

source: This can be costly performancewise when an application regularly accesses a very large number of files or directories.
pt_br: Isto pode ser caro em termos de performance quando uma aplicação freqüentemente acessa um número muito grande de arquivos ou diretórios.

source: Some Unix filesystems can be mounted with atime updates disabled to increase the performance of such applications; USENET news spools are a common example.
pt_br: Alguns filesystems Unix podem ser montados com updates dos atimes desabilitados para aumentar a performance destas aplicações; USENET news spools é um exemplo comum.

source: On such filesystems this function will be useless.
pt_br: Nestes filesystems esta função é inútil.

source: Returns the time the file was last changed, or FALSE in case of an error.
pt_br: Retorna o tempo em que o arquivo foi modificado pela última vez, ou FALSE em caso de erro.

source: In most Unix filesystems, a file is considered changed when its inode data is changed; that is, when the permissions, owner, group, or other metadata from the inode is updated.
pt_br: Na maior parte dos filesystems Unix, um arquivo é considerado modificado quando a informação do inode é modificada; isto é, quando as permissões, dono (owner), grupo (group), ou outra metadata do inode é modificada.

source: See also filemtime() (which is what you want to use when you want to create "Last Modified "footers on web pages) and fileatime().
pt_br: Veja também filemtime() (o que é o que você deseja usar quando criando rodapés com informações sobre última vez que o arquivo foi modificado em web pages) e fileatime().

source: Note also that in some Unix texts the ctime of a file is referred to as being the creation time of the file.
pt_br: Note também que em alguns textos Unix o ctime do arquivo é referido como sendo o tempo de criação do tempo do arquivo.

source: This is wrong.
pt_br: Isto é errado.

source: There is no creation time for Unix files in most Unix filesystems.
pt_br: Não há tempo de criação de arquivos Unix na maior parte dos filesystems Unix.

source: This function will not work on remote files; the file to be examined must be accessible via the server's filesystem.
pt_br: Esta função não irá funcionar em arquivos remotos; o arquivo a ser examinado tem que ser acessivel pelo filesystem do servidor.

source: Returns TRUE if the file specified by filename exists; FALSE otherwise.
pt_br: Retorna TRUE se o arquivo expecificado por nomedoarquivo existe; FALSE caso contrário.

source: Using Windows shares:
pt_br: Utilizando compartilhamentos Windows:

source: On windows, use / /computername / share / filename or \\\\computername\share\filename to check files on network shares.
pt_br: No Windows, use / /computername / share / filename ou \\\\computername\share\filename para checar arquivos em compartilhamentos de rede.

source: Testing whether a file exists
pt_br: Testando se um arquivo existe

source: ?php $filename = '/ path / to / foo.txt'; if (file_exists($filename)) {print "The file $filename exists";} else {print "The file $filename does not exist";}?
pt_br: ?php $filename = '/ caminho / para / qualquer.txt'; if (file_exists($filename)) {print "O arquivo $filename existe";} else {print "O arquivo $filename não existe";}?

source: See also is_readable(), is_writable(), is_file() and file().
pt_br: Veja também is_readable(), is_writable(), is_file() e file().

source: Identical to file(), except that file_get_contents() returns the file in a string.
pt_br: Idêntico a readfile(), exceto que file_get_contents() retorna o arquivo em uma string.

source: This function is binary-safe.
pt_br: Esta função é compatível com dados binários

source: See also: fgets(), file(), fread(), include(), and readfile().
pt_br: Veja também: fgets(), file(), fread(), include() e readfile().

source: Returns the group ID of the file, or FALSE in case of an error.
pt_br: Retorna o group ID do arquivo, ou FALSE no caso de um erro.

source: The group ID is returned in numerical format, use posix_getgrgid() to resolve it to a group name.
pt_br: Use posix_getgrgid() para resolver para o nome do grupo.

source: The results of this function are cached.
pt_br: O resultado desta função é guardado em cache.

source: Each element of the array corresponds to a line in the file, with the newline still attached.
pt_br: Descrição

source: Each line in the resulting array will include the line ending, so you still need to use trim() if you do not want the line ending present.
pt_br: Em caso de falha, file() retorna FALSE.

source: You can use the optional use_include_path parameter and set it to "1", if you want to search for the file in the include_path, too.
pt_br: Se você está tendo problemas com o PHP no reconhecimento do final de linha quando criando ou lendo arquivos num computador Macintosh, você pode habilitar a opção auto_detect_line_endings.

source: In PHP 4.3.0 file() became binary safe.
pt_br: Veja também file_get_contents(). $html = implode ('', file ('http: / /www.exemplo.com / '));?

source: See also readfile(), fopen(), fsockopen(), popen(), file_get_contents(), and include().
pt_br: Veja também readfile(), fopen(), fsockopen(), and popen(), file_get_contents() e include().

source: Returns the inode number of the file, or FALSE in case of an error.
pt_br: Retorna o número do inode do arquivo, ou FALSE em caso de erro.

source: The time is returned as a Unix timestamp, which is suitable for the date() function.
pt_br: Descrição

source: See clearstatcache() for more details.
pt_br: O tempo é retornado como um timestamp Unix.

source: This function returns the time when the data blocks of a file were being written to, that is, the time when the content of the file was changed.
pt_br: Esta função não funcionará em arquivos remotos; o arquivo a ser examinado tem que ser acessivel pelo filesystem do servidor.

source: Example 1. filemtime() example
pt_br: Utilize date() no resultado desta função para obter uma versão imprimível da data (para a utilização em rodapés).

source: See also filectime(), stat(), touch(), and getlastmod().
pt_br: Veja também filectime() e touch().

source: Returns the user ID of the owner of the file, or FALSE in case of an error.
pt_br: Retorna o ID do usuário( user ID) do dono (owner) do arquivo, ou FALSE caso um erro.

source: The user ID is returned in numerical format, use posix_getpwuid() to resolve it to a username.
pt_br: O ID do usuário é retornado no formato numérico, use posix_getpwuid() para obter o username do usuário.

source: Returns the permissions on the file, or FALSE in case of an error.
pt_br: Retorna as permissões do arquivo, ou FALSE em caso de erro.

source: This reads and verifies the map file, storing the field count and info.
pt_br: Description

source: Returns the size of the file in bytes, or FALSE in case of an error.
pt_br: Retorna o tamanho do arquivo, ou FALSE em caso de erro.

source: Possible values are fifo, char, dir, block, link, file, and unknown.
pt_br: Retorna o tipo do arquivo( file type).

source: Returns FALSE if an error occurs. filetype() will also produce an E_NOTICE message if the stat call fails or if the file type is unknown.
pt_br: Retorna FALSE se um erro ocorrer.

source: See also: is_dir(), is_file(), is_link(), file_exists(), and stat().
pt_br: Veja também: is_dir(), is_file(), is_link(), file_exists() e stat().

source: Returns the float value of var.
pt_br: Description

source: PHP supports a portable way of locking complete files in an advisory way (which means all accessing programs have to use the same way of locking or it will not work).
pt_br: O PHP suporta uma maneira portável de lock arquivos inteiros em uma advisory way (que significa que todos os programas acessando tem que usar o mesmo tipo de travamento ou não irá funcionar).

source: flock() operates on handle which must be an open file pointer. operation is one of the following values:
pt_br: flock() opera em fp, que tem que ser um ponteiro de arquivo aberto com sucesso. operacao é um dos seguintes valores:

source: To acquire a shared lock (reader), set operation to LOCK_SH (set to 1 prior to PHP 4.0.1).
pt_br: Para obter um lock compartilhado (leitura), utilize operation como LOCK_SH (ou use 1 se a versão do PHP for anterior a 4.0.1).

source: To acquire an exclusive lock (writer), set operation to LOCK_EX (set to 2 prior to PHP 4.0.1).
pt_br: Para obter um lock exclusivo (gravação), utilize operacao como LOCK_EX (ou use 2 se a versão do PHP for anterior a 4.0.1).

source: To release a lock (shared or exclusive), set operation to LOCK_UN (set to 3 prior to PHP 4.0.1).
pt_br: Para retirar um lock (compartilhado ou exclusivo), uyilize operacao como LOCK_UN (ou use 3 se a versão do PHP for anterior a 4.0.1).

source: If you don' t want flock() to block while locking, add LOCK_NB (4 prior to PHP 4.0.1) to operation.
pt_br: Se você não quer usar flock() para bloquear enquanto travando, adicione LOCK_NB (4 se a versão do PHP for anterior a 4.0.1) a operacao.

source: flock() allows you to perform a simple reader / writer model which can be used on virtually every platform (including most Unix derivatives and even Windows).
pt_br: flock() permite a você fazer um simples modelo leitura / gravação (reader / writer) que pode ser usado em virtualmente todas as plataformas (incluindo a maior parte dos Unixes e até mesmo Windows).

source: The optional third argument is set to TRUE if the lock would block (EWOULDBLOCK errno condition)
pt_br: O terceiro argumento opcional é usado como TRUE se a lock irá bloquear (EWOULDBLOCK errno condition).

source: Because flock() requires a file pointer, you may have to use a special lock file to protect access to a file that you intend to truncate by opening it in write mode (with a "w "or "w+" argument to fopen()).
pt_br: Uma vez que flock() requer um ponteiro de arquivo, você precisa utilizar um lock de arquivo especial para proteger i acessi a um arquivo ao qual você pretende truncar quando abrindo no modo de escrita (com um argumento "w "ou "w+" em fopen()).

source: flock() will not work on NFS and many other networked file systems.
pt_br: flock() não funcionará em NFS ou em qualquer outro sistema de arquivos em rede.

source: Check your operating system documentation for more details.
pt_br: Verifique a documentação do seu sistema operacional para mais detalhes.

source: On some operating systems flock() is implemented at the process level.
pt_br: Na maior parte dos sistemas operacionais flock() é implementada no nível do processo.

source: When using a multithreaded server API like ISAPI you may not be able to rely on flock() to protect files against other PHP scripts running in parallel threads of the same server instance!
pt_br: Quando utilizando um servidor com uma API de multiprocessamento (como ISAPI), você não pode confiar em flock() para proteger os arquivos contra outros scripts PHP rodando em threads paralelas da mesma instância do servidor!

source: flock() is not supported on antiquated filesystems like FAT and its derivates and will therefore always return FALSE under this environments (this is especially true for Windows 98 users).
pt_br: flock() não é suportado em sistemas de arquivos antiquados como a FAT e seus derivados, e sempre retornará FALSE sob esses ambientes (especialmente para usuários do Windows 98).

source: Returns the next lowest integer value by rounding down value if necessary.
pt_br: Retorna o próximo menor valor inteiro ao se arredondar para baixo o valor, se necessário.

source: The return value of floor() is still of type float because the value range of float is usually bigger than that of integer.
pt_br: O valor retornado de floor() é do tipo float porque o tipo float normalmente abrange mais números possíveis do que integer.

source: Example 1. floor() example
pt_br: Exemplo 1. exemplos de floor()

source: See also ceil() and round().
pt_br: Veja também ceil() e round().

source: fnmatch() checks if the passed string would match the given shell wildcard pattern.
pt_br: fnmatch() checa se a string se encaixa com o pattern.

source: This is especialy usefull for filenames, but may also be used on regular strings.
pt_br: Isto é especialmente útil para nomes de arquivos, mas também pode ser utilizado em strings.

source: The average user may be used to shell patterns or at least in their simplest form to '?' and '* 'wildcards so using fnmatch() instead of ereg() or preg_match() for frontend search expression input may be way more convenient for non-programming users.
pt_br: O usuário comum poderá utilizar curingas shell na sua forma mais simples ('?' e '* ') com fnmatch() em vez de ereg() ou preg_match() para pesquisas realizadas em código, numa forma mais inteligível para usuários não programadores.

source: Checking a color name against a shell wildcard pattern.
pt_br: Verificando um nome de cor com um padrão shell

source: if( fnmatch("*gr[ae]y", $color)) {echo "some form of gray.. .";}
pt_br: if( fnmatch("*gr[ae]y", $color)) {echo "alguma forma da palavra gray.. .";}

source: See also glob(), ereg(), preg_match() and the unix manpage on fnmatch(3) for flag names (as long as they are not documented here).
pt_br: Veja também glob(), ereg(), preg_match() e a manpage UNIX de fnmatch(3) para nomes de flags (já que não estão documentadas aqui).

source: fopen() binds a named resource, specified by filename, to a stream.
pt_br: fopen() conecta um recurso nomeado, especificado em filename para um stream.

source: If filename is of the form "scheme: / /.. .", it is assumed to be a URL and PHP will search for a protocol handler (also known as a wrapper) for that scheme.
pt_br: Se filename está na forma "protocolo: / /.. .", é assumido que seja uma URL e o PHP irá procurar por um manipulador de protocolo (também conhecido como wrapper) conforme o prefixo.

source: If no wrappers for that protocol are registered, PHP will emit a notice to help you track potential problems in your script and then continue as though filename specifies a regular file.
pt_br: Se nenhum wrapper para o protocolo estiver registrado, o PHP irá emitir um alerta para ajudá-lo a rastrear problemas potenciais em seu script, presumindo que filename é um nome de arquivo comum.

source: If PHP has decided that filename specifies a local file, then it will try to open a stream on that file.
pt_br: Se o PHP decidir que filename se refere a um arquivo local, então ele tentará abrir o stream para aquele arquivo.

source: The file must be accessible to PHP, so you need to ensure that the file access permissions allow this access.
pt_br: Esse arquivo precisa ser acessível pelo PHP, então você precisa certificar-se que as permissões de acesso que garantam esse acesso.

source: If you have enabled safe_mode, or open_basedir further restrictions may apply.
pt_br: Se você está com safe_mode ativado ou open_basedir, essas restrições serão aplicadas.

source: If PHP has decided that filename specifies a registered protocol, and that protocol is registered as a network URL, PHP will check to make sure that allow_url_fopen If PHP has decided that filename specifies a registered protocol, and that protocol is registered as a network URL, PHP will check to make sure that allow_url_fopen is enabled.
pt_br: Se o PHP decidir que filename se refere a um protocolo registrado, e que o protocolo está registrado como um URL de rede, o PHP irá verificar se allow_url_fopen Se o PHP decidir que filename se refere a um protocolo registrado, e que o protocolo está registrado como um URL de rede, o PHP irá verificar se allow_url_fopen está ativado.

source: If it is switched off, PHP will emit a warning and the fopen call will fail.
pt_br: Se ele estiver desligado, o PHP irá emitir um alerta e a chamada a fopen irá falhar.

source: The list of supported protocols can be found in Appendix I.
pt_br: A lista de protocolos registrados pode ser encontrada em Apêndice I.

source: mode specifies the type of access you require to the stream.
pt_br: mode especifica a tipo de acesso que você requer na stream.

source: It may be any of the following:
pt_br: Ele pode ser um dos seguintes:

source: 'r' - Open for reading only; place the file pointer at the beginning of the file.
pt_br: 'r' - Abrir somente para leitura; coloca o ponteiro de arquivo no começo do arquivo.

source: 'r+' - Open for reading and writing; place the file pointer at the beginning of the file.
pt_br: 'r+' - Abrir para leitura e gravação; colocar o ponteiro de arquivo no começo do arquivo.

source: 'w' - Open for writing only; place the file pointer at the beginning of the file and truncate the file to zero length.
pt_br: 'w' - Abrir somente para gravação; colocar o ponteiro de arquivo no começo do arquivo e truncar o arquivo para tamanho zero.

source: If the file does not exist, attempt to create it.
pt_br: Se o arquivo não existir, tentar cria-lo.

source: 'w+' - Open for reading and writing; place the file pointer at the beginning of the file and truncate the file to zero length.
pt_br: 'w+' - Abrir para leitura e escrita; colocar o ponteiro de arquivo no início do arquivo e truncar o arquivo para tamanho zero.

source: 'a' - Open for writing only; place the file pointer at the end of the file.
pt_br: 'a' - Abrir o arquivo somente para escrita; colocar o ponteiro de arquivo no fim do arquivo.

source: 'a+' - Open for reading and writing; place the file pointer at the end of the file.
pt_br: 'a+' - Abrir o arquivo para leitura e gravação; colocar o ponteiro no fim do arquivo.

source: The mode may contain the letter 'b'.
pt_br: O mode O mode pode conter a letra 'b'.

source: Windows.
pt_br: Isto é útil somente em sistemas que diferenciam entre arquivos binários e texto (por exemplo Windows.

source: It' s useless on Unix).
pt_br: É inútil em Unix).

source: If not needed, this will be ignored.
pt_br: Se não necessário, será ignorado.

source: You are encouraged to include the 'b' flag in order to make your scripts more portable.
pt_br: Você é encorajado a incluir o modo 'b' de forma a tornar seus scripts mais portáveis.

source: The optional third use_include_path parameter can be set to '1' or TRUE if you want to search for the file in the include_path, too.
pt_br: Você pode usar o terceiro pparâmetro opcional como "1", se você quiser procurar pelo arquivo no include_path também.

source: The optional fourth zcontext is used for specifying tuning parameters and callbacks.
pt_br: O quarto parâmetro zcontext (opcional) é utilizado especificamente para ajuste de parâmetros e callbacks.

source: If the open fails, the function returns FALSE.
pt_br: Se a abertura falhar, a função retorna FALSE.

source: Example 1. fopen() example
pt_br: Exemplo 1. exemplo do fopen()

source: ?php $handle = fopen ("/ home / rasmus / file.txt", "r"); $handle = fopen (" / home / rasmus / file.gif", "wb"); $handle = fopen ("http: / /www.example.com /", "r"); $handle = fopen ("ftp: / /user:password@example.com / somefile.txt", "w");?
pt_br: ?php $fp = fopen ("/ home / rasmus / file.txt", "r"); $fp = fopen (" / home / rasmus / file.gif", "wb"); $fp = fopen ("http: / /www.example.com /", "r"); $fp = fopen ("ftp: / /user:password@example.com / ", "w");?

source: If you are experiencing problems with reading and writing to files and you' re using the server module version of PHP, remember to make sure that the files and directories you're using are accessible to the server process.
pt_br: Se você está tendo problemas com a leitura e gravação para arquivos e você está usando a versão de modulo de servidor do PHP, lembre-se de que os arquivos e diretórios que você está usando precisam ser acessíveis ao processo do servidor HTTP.

source: On the Windows platform, be careful to escape any backslashes used in the path to the file, or use forward slashes.
pt_br: Na plataforma Windows, tenha cuidado para usar uma segunda barra invertida (escape) nos caminhos de arquivos, ou usar a barra normal.

source: ?php $handle = fopen ("c:\\data\\info.txt", "r");?
pt_br: ?php $fp = fopen ("c:\\data\\info.txt", "r");?

source: See also Appendix I, fclose(), fgets(), fsockopen(), file(), file_exists(), is_readable(), socket_set_timeout(), and popen().
pt_br: Apêndice I, fclose(), fgets(), fsockopen(), file(), file_exists(), is_readable(), socket_set_timeout() e popen().

source: Reads to EOF on the given file pointer from the current position and writes the results to the output buffer.
pt_br: Descrição

source: Otherwise, fpassthru() returns the number of characters read from handle and passed through to the output.
pt_br: Se um error ocorrer, a função fpassthru() retorna FALSE.

source: You may need to call rewind() You may need to call rewind() to reset the file pointer to the beginning of the file if you have already written data to the file.
pt_br: Você pode precisar chamar rewind() para reiniciar o ponteiro do arquivo para o início do arquivo caso você já tenha escrito dados no arquivo.

source: The file is closed when fpassthru() is done reading it (leaving handle useless).
pt_br: O arquivo é fechado quando fpassthru() acaba de ler (deixando fp sem utilidade).

source: If you just want to dump the contents of a file to the output buffer, without first modifying it or seeking to a particular offset, you may want to use the readfile(), which saves you the fopen() call.
pt_br: Se você somente quiser jogar o conteúdo de um arquivo para o buffer de saída, sem primeiro modificar ou procurar por um detalhe qualquer, você pode querer usar a função readfile(), que vai economizar uma chamada a função fopen().

source: When using fpassthru() on a binary file on Windows systems, you should make sure to open the file in binary mode by appending a b to the mode used in the call to fopen().
pt_br: Quando utilizando fpassthru() em um arquivo binário em sistemas Windows, você precisa verificar se abriu o arquivo em modo binário, acrescentando um b no modo informado na chamada de fopen().

source: You are encouraged to use the b flag when dealing with binary files, even if your system does not require it, so that your scripts will be more portable.
pt_br: Você é encorajado a utilizar o modo b quando trabalhando com arquivos binários, mesmo que seu sistema não requira isso, de forma que seus scripts se tornem mais portáveis.

source: See also readfile(), fopen(), popen(), and fsockopen()
pt_br: Veja também readfile(), fopen(), popen() e fsockopen()

source: See also: printf(), sprintf(), sscanf(), fscanf(), vsprintf(), and number_format().
pt_br: Examples
